{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"config": {"function_type": "lambda", "batch_input_shape": [null, 100, 200, 3], "trainable": true, "output_shape": null, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA05nAAAAAADgb0BnAAAAAAAA\n4D+pACkB2gF4cgEAAAByAQAAAPouL2hvbWUvbmFqaS9EZXNrdG9wL21vZGVscy9OVklESUEvY29k\nZS9tb2RlbC5wedoIPGxhbWJkYT4MAAAAcwAAAAA=\n", null, null], "name": "lambda_1", "output_shape_type": "raw", "arguments": {}}, "class_name": "Lambda"}, {"config": {"strides": [2, 2], "activation": "relu", "filters": 24, "activity_regularizer": null, "trainable": true, "kernel_size": [5, 5], "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid", "use_bias": true, "kernel_constraint": null, "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "activation": "relu", "filters": 36, "activity_regularizer": null, "trainable": true, "kernel_size": [5, 5], "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid", "use_bias": true, "kernel_constraint": null, "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "activation": "relu", "filters": 48, "activity_regularizer": null, "trainable": true, "kernel_size": [5, 5], "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid", "use_bias": true, "kernel_constraint": null, "name": "conv2d_3"}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 64, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid", "use_bias": true, "kernel_constraint": null, "name": "conv2d_4"}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "activation": "relu", "filters": 64, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid", "use_bias": true, "kernel_constraint": null, "name": "conv2d_5"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 100, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 50, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 10, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 1, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "name": "dense_4"}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}