{"config": {"name": "sequential_1", "layers": [{"config": {"trainable": true, "arguments": {}, "dtype": "float32", "output_shape": null, "batch_input_shape": [null, 160, 320, 3], "output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AABkAQAbZAIAGFMpA05nAAAAAADgb0BnAAAAAAAA\n4D+pACkB2gF4cgEAAAByAQAAAPofPGlweXRob24taW5wdXQtMTEtOWMxOGYzYzAyZDQ1PtoIPGxh\nbWJkYT4EAAAAcwAAAAA=\n", null, null]}, "class_name": "Lambda"}, {"config": {"name": "cropping2d_1", "trainable": true, "cropping": [[70, 25], [0, 0]], "data_format": "channels_last"}, "class_name": "Cropping2D"}, {"config": {"filters": 24, "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "name": "conv2d_1", "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"filters": 36, "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "name": "conv2d_2", "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"filters": 48, "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "name": "conv2d_3", "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"filters": 64, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "name": "conv2d_4", "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"filters": 64, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "name": "conv2d_5", "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "units": 100, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "units": 50, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "name": "dense_3", "kernel_regularizer": null, "units": 10, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "name": "dense_4", "kernel_regularizer": null, "units": 1, "use_bias": true}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}